In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
train = pd.read_csv('https://raw.githubusercontent.com/luxdolorosa/data_set/master/titanic/train.csv')
test = pd.read_csv('https://raw.githubusercontent.com/luxdolorosa/data_set/master/titanic/test.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 자료 기본 구성 확인

In [3]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
train.shape   #891행, 15열

(891, 12)

In [5]:
# 데이터의 컬럼 살펴보기
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [7]:
train.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [8]:
train.loc[train.Survived==0, : ].Pclass.value_counts()

3    372
2     97
1     80
Name: Pclass, dtype: int64

In [9]:
train.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [10]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

## age, cabin, embarked 결측치 대체/ 삭제

In [12]:
#embarked 결측치 최다값 s로 대체

train['Embarked'].fillna('S', inplace=True)

In [13]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [14]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [15]:
# 필요없는 컬럼 삭제
train = train.drop(['Cabin'],axis=1)

In [16]:
test = test.drop(['Cabin'],axis=1)

In [19]:
test.isnull().sum()

PassengerId     0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            0
Embarked        0
dtype: int64

In [18]:
test['Fare'].fillna(test['Fare'].mean(), inplace=True)

In [40]:
train.loc[train['Pclass']==1,'Age'].mean()

38.233440860215055

In [41]:
train.loc[train['Pclass']==2,'Age'].mean()

29.87763005780347

In [42]:
train.loc[train['Pclass']==3,'Age'].mean()

25.14061971830986

In [43]:
train.groupby('Pclass').mean()

        PassengerId  Survived        Age     SibSp     Parch       Fare
Pclass
1        461.597222  0.629630  38.233441  0.416667  0.356481  84.154687
2        445.956522  0.472826  29.877630  0.402174  0.380435  20.662183
3        439.154786  0.242363  25.140620  0.615071  0.393075  13.675550

In [44]:
test.groupby('Pclass').mean()

        PassengerId        Age     SibSp     Parch       Fare
Pclass
1       1098.224299  40.918367  0.476636  0.383178  94.280297
2       1117.935484  28.777500  0.376344  0.344086  22.202104
3       1094.178899  24.027945  0.463303  0.417431  12.459678

In [20]:
train['Age'].fillna(train.groupby('Pclass')['Age'].transform('mean'), inplace=True)
test['Age'].fillna(test.groupby('Pclass')['Age'].transform('mean'), inplace=True)

In [21]:
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [22]:
test.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [23]:
train['Age_cut']=pd.cut(train.Age, bins=[0,10,20,30,40,50,60,200],labels=[0,1,2,3,4,5,6])

In [24]:
test['Age_cut']=pd.cut(test.Age, bins=[0,10,20,30,40,50,60,200],labels=[0,1,2,3,4,5,6])

In [25]:
train.Age_cut.value_counts().to_frame().style.background_gradient(cmap='summer')

In [26]:
train['family_size'] = train.SibSp + train.Parch
# family_size에 동반한 가족의 유무를 넣는다

In [27]:
test['family_size'] = test.SibSp + test.Parch

In [28]:
train['is_solo'] = train.family_size.apply(lambda x : 1 if x == 0 else 0)
# 동반한 가족이 없으면 is_solo에 1을 넣음di

In [29]:
test['is_solo'] = test.family_size.apply(lambda x : 1 if x == 0 else 0)

In [31]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Age_cut,family_size,is_solo
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q,3,0,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S,4,1,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q,6,0,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S,2,0,1
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S,2,2,0

In [35]:
test.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Age_cut        0
family_size    0
is_solo        0
dtype: int64

In [36]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Age_cut,family_size,is_solo
886,887,0,2,"Montvila, Rev. Juozas",male,27.00000,0,0,211536,13.00,S,2,0,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.00000,0,0,112053,30.00,S,1,0,1
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,25.14062,1,2,W./C. 6607,23.45,S,2,3,0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00000,0,0,111369,30.00,C,2,0,1
890,891,0,3,"Dooley, Mr. Patrick",male,32.00000,0,0,370376,7.75,Q,3,0,1

In [37]:
train['Fare_cut']=pd.cut(train.Fare, bins=[-1,15,30,60,200000],labels=[1,2,3,4])

In [38]:
test['Fare_cut']=pd.cut(test.Fare, bins=[-1,15,30,60,200000],labels=[1,2,3,4])

In [39]:
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Age_cut        0
family_size    0
is_solo        0
Fare_cut       0
dtype: int64

In [40]:
test.isnull().sum()

PassengerId    0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Age_cut        0
family_size    0
is_solo        0
Fare_cut       0
dtype: int64

In [41]:
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Age_cut,family_size,is_solo,Fare_cut
886,887,0,2,"Montvila, Rev. Juozas",male,27.00000,0,0,211536,13.00,S,2,0,1,1
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.00000,0,0,112053,30.00,S,1,0,1,2
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,25.14062,1,2,W./C. 6607,23.45,S,2,3,0,2
889,890,1,1,"Behr, Mr. Karl Howell",male,26.00000,0,0,111369,30.00,C,2,0,1,2
890,891,0,3,"Dooley, Mr. Patrick",male,32.00000,0,0,370376,7.75,Q,3,0,1,1

In [42]:
train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
Age_cut        0
family_size    0
is_solo        0
Fare_cut       0
dtype: int64

In [43]:
# 성별을 머신러닝에서 연산이 가능하도록 수치성으로 변경하기
# 람다연산 조건문 : lambda x: 참일때 if조건 else 거짓일때
train.Sex = train.Sex.apply(lambda x: 0 if x == 'male' else 1)
# 남성은 0, 여성은 1

In [44]:
test.Sex = test.Sex.apply(lambda x: 0 if x == 'male' else 1)

In [45]:
# C == 0, S == 1, Q == 2
# 이렇게 되면 파이썬에서는
# 2 * S == Q?
# S + S = Q??
# 이렇게 읽을 수 있는 가능성이 있음 그래서 이럴때는

# One Hot Encoding
# [1,0,0] [0.1,0] [0,0,1]
#파이썬에서는 True == 1, False == 0
# C == [1,0,0] ->  [True, False, False]
# S == [0,1,0] -> [False, True, False]
# Q == [0,0,1] -> [False, False, True]

train["Embarked_C"] = train["Embarked"] == 'C'
train["Embarked_S"] = train["Embarked"] == 'S'
train["Embarked_Q"] = train["Embarked"] == 'Q'

In [46]:
test["Embarked_C"] = test["Embarked"] == 'C'
test["Embarked_S"] = test["Embarked"] == 'S'
test["Embarked_Q"] = test["Embarked"] == 'Q'

In [47]:
train["Pclass_1"] = train["Pclass"] == 1
train["Pclass_2"] = train["Pclass"] == 2
train["Pclass_3"] = train["Pclass"] == 3

print(train.shape)
train[["Pclass","Pclass_1","Pclass_2","Pclass_3"]]

(891, 21)

     Pclass  Pclass_1  Pclass_2  Pclass_3
0         3     False     False      True
1         1      True     False     False
2         3     False     False      True
3         1      True     False     False
4         3     False     False      True
..      ...       ...       ...       ...
886       2     False      True     False
887       1      True     False     False
888       3     False     False      True
889       1      True     False     False
890       3     False     False      True

[891 rows x 4 columns]

In [48]:
test["Pclass_1"] = test["Pclass"] == 1
test["Pclass_2"] = test["Pclass"] == 2
test["Pclass_3"] = test["Pclass"] == 3

print(test.shape)
test[["Pclass","Pclass_1","Pclass_2","Pclass_3"]]

(418, 20)

     Pclass  Pclass_1  Pclass_2  Pclass_3
0         3     False     False      True
1         3     False     False      True
2         2     False      True     False
3         3     False     False      True
4         3     False     False      True
..      ...       ...       ...       ...
413       3     False     False      True
414       1      True     False     False
415       3     False     False      True
416       3     False     False      True
417       3     False     False      True

[418 rows x 4 columns]

# Step6. 모델 설계 및 학습
- 모델(머신러닝)에서 사용할 컬럼(feature)를 선정하기

In [50]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Age_cut,family_size,is_solo,Fare_cut,Embarked_C,Embarked_S,Embarked_Q,Pclass_1,Pclass_2,Pclass_3
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,...,2,1,0,1,False,True,False,False,False,True
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,...,3,1,0,4,True,False,False,True,False,False
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,...,2,0,1,1,False,True,False,False,False,True
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,...,3,1,0,3,False,True,False,True,False,False
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,...,3,0,1,1,False,True,False,False,False,True

In [51]:
feature_names = ["Sex","Pclass_1","Pclass_2","Pclass_3","Embarked_S","Embarked_C","Embarked_Q","Fare_cut","Age_cut","is_solo"]
feature_names

['Sex',
 'Pclass_1',
 'Pclass_2',
 'Pclass_3',
 'Embarked_S',
 'Embarked_C',
 'Embarked_Q',
 'Fare_cut',
 'Age_cut',
 'is_solo']

In [52]:
# 특성을 이용하여 머신러닝의 모델을 만들 데이터를 만들기

x_train = train[feature_names]
x_train.head()

,Sex,Pclass_1,Pclass_2,Pclass_3,Embarked_S,Embarked_C,Embarked_Q,Fare_cut,Age_cut,is_solo
0,0,False,False,True,True,False,False,1,2,0
1,1,True,False,False,False,True,False,4,3,0
2,1,False,False,True,True,False,False,1,2,1
3,1,True,False,False,True,False,False,3,3,0
4,0,False,False,True,True,False,False,1,3,1

In [53]:
x_test = test[feature_names]
x_test.head()

,Sex,Pclass_1,Pclass_2,Pclass_3,Embarked_S,Embarked_C,Embarked_Q,Fare_cut,Age_cut,is_solo
0,0,False,False,True,False,False,True,1,3,1
1,1,False,False,True,True,False,False,1,4,0
2,0,False,True,False,False,False,True,1,6,1
3,0,False,False,True,True,False,False,1,2,1
4,1,False,False,True,True,False,False,1,2,0

In [54]:
# y값(정답) 만들기
label_name = 'Survived'
y_train = train[label_name]
y_train

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

# 데이터 검사

In [55]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import make_scorer
from sklearn.model_selection import cross_val_score

In [56]:
# 모델 만들기
model = RandomForestClassifier(n_estimators = 15)     # 15번 학습시키겠다
model

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=15,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [57]:
# 모델을 학습시키기
model.fit(x_train, y_train)

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features='auto',
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=15,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [58]:
# 예측하기
pridections = model.predict(x_test)
pridections.shape

(418,)

In [59]:
# 정확도 측정
score = cross_val_score(model, x_train, y_train, cv=20, scoring='accuracy')

In [60]:
round(np.mean(score) * 100, 2)

80.14

In [61]:
# 제출용 데이터 만들기
submit = pd.read_csv('https://raw.githubusercontent.com/luxdolorosa/data_set/master/titanic/gender_submission.csv', index_col = 0)
submit.head()

             Survived
PassengerId
892                 0
893                 1
894                 0
895                 0
896                 1

In [62]:
submit.Survived = pridections
submit.head()

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 0

In [64]:
submit.to_csv('C:\\Users\\id272\\LSJ\\noeul\\result_noeul.csv')

## Decision Tree

In [65]:
# 특성을 이용하여 머신러닝의 모델을 만들 데이터를 만들기

x_train = train[feature_names]
x_train.head()

,Sex,Pclass_1,Pclass_2,Pclass_3,Embarked_S,Embarked_C,Embarked_Q,Fare_cut,Age_cut,is_solo
0,0,False,False,True,True,False,False,1,2,0
1,1,True,False,False,False,True,False,4,3,0
2,1,False,False,True,True,False,False,1,2,1
3,1,True,False,False,True,False,False,3,3,0
4,0,False,False,True,True,False,False,1,3,1

In [66]:
x_test = test[feature_names]
x_test.head()

,Sex,Pclass_1,Pclass_2,Pclass_3,Embarked_S,Embarked_C,Embarked_Q,Fare_cut,Age_cut,is_solo
0,0,False,False,True,False,False,True,1,3,1
1,1,False,False,True,True,False,False,1,4,0
2,0,False,True,False,False,False,True,1,6,1
3,0,False,False,True,True,False,False,1,2,1
4,1,False,False,True,True,False,False,1,2,0

In [67]:
label_name = "Survived"

y_train = train[label_name]

print(y_train.shape)
y_train.head()

(891,)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [68]:
# scikit-learn == sklearn
from sklearn.tree  import DecisionTreeClassifier

model = DecisionTreeClassifier(max_depth = 20)
model

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=20, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [69]:
# 1)fit 머신러닝 알고리즘을 학습 시키는 것 데이터 사이의 패턴을 머신러닝 알고리즘이 스스로 판단
# fit 할때는 train 데이터 predict 할때는 test 데이터
# 2) predict
model.fit(x_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=20, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [70]:
prediction = model.predict(x_test)

print(prediction.shape)
prediction[0:5]

(418,)

array([0, 0, 0, 0, 0], dtype=int64)

In [72]:
submit= pd.read_csv('https://raw.githubusercontent.com/luxdolorosa/data_set/master/titanic/gender_submission.csv', index_col = 0)

submit["Survived"] = prediction

print(submit.shape)
submit.head()

(418, 1)

             Survived
PassengerId
892                 0
893                 0
894                 0
895                 0
896                 0

In [75]:
#저장
submit.to_csv("C:\\Users\\id272\\LSJ\\noeul\\result_decisiontree_noeul.csv")